{
  "pages": [
    {
      "title": "Missing Persons Investigation Services",
      "serviceOverview": "At Oriental Detective, we offer expert Missing Persons Investigation Services designed to bring resolution and closure to families and loved ones dealing with the distressing situation of a missing person...",
      "whatWeDo": [
        "Detailed Investigative Protocols",
        "Witness Interviews & Source Gathering",
        "Use of Forensic Technology",
        "Collaborations with Law Enforcement",
        "Nationwide & Global Reach",
        "Regular Updates & Transparent Communication"
      ],
      "whenToContactUs": [
        "When a loved one has suddenly gone missing and you suspect foul play or a potential threat to their safety.",
        "If the individual has been missing for an extended period and all leads have run cold.",
        "When you believe the person may be intentionally hiding, using false identities, or involved in criminal activity.",
        "If you suspect a case of abduction or human trafficking."
      ],
      "whyChooseUs": [
        "Expert investigators with decades of experience in solving missing persons cases.",
        "Cutting-edge forensic technology to aid in locating and tracking missing individuals.",
        "Discretion and sensitivity to protect your privacy and emotional well-being during a difficult time.",
        "Global reach to investigate missing persons across national borders."
      ]
    },
    {
      "title": "Background Check Services",
      "serviceOverview": "Oriental Detective provides comprehensive and reliable Background Check Services that go far beyond the basics...",
      "whatWeDo": [
        "Comprehensive Criminal Background Checks",
        "Employment History Verification",
        "Educational & Qualification Verification",
        "Financial & Credit Checks",
        "Social Media & Online Reputation Screening",
        "Personal References & Character Assessment",
        "Ongoing Monitoring (Optional)"
      ],
      "whenToContactUs": [
        "Before hiring employees, especially for high-risk or sensitive roles.",
        "When you need to verify the background of a potential partner or client.",
        "If you’re entering into a business deal and want to ensure your partner’s financial stability and credibility.",
        "When you want to know more about someone you plan to bring into your personal or professional life."
      ],
      "whyChooseUs": [
        "Thorough and exhaustive checks that cover all aspects of an individual’s history.",
        "Timely and accurate results delivered in an easy-to-understand format.",
        "Confidentiality guaranteed for all personal and sensitive data.",
        "Customizable packages to meet your unique background check needs."
      ]
    },
    {
      "title": "Surveillance Services",
      "serviceOverview": "Oriental Detective offers professional and discreet Surveillance Services to help you uncover the truth behind suspicious activities...",
      "whatWeDo": [
        "Covert Surveillance Techniques",
        "Digital & Online Surveillance",
        "Tracking & Monitoring",
        "Video & Audio Evidence Collection",
        "Surveillance for Infidelity & Personal Investigations",
        "Employee Surveillance & Workplace Monitoring"
      ],
      "whenToContactUs": [
        "If you suspect infidelity or other personal issues in a relationship.",
        "If you're concerned about employee misconduct, theft, or unethical behavior at your business.",
        "If you need to gather evidence for legal proceedings, such as custody battles or insurance fraud cases.",
        "When you suspect someone is involved in fraudulent activities and want proof to take legal action."
      ],
      "whyChooseUs": [
        "Highly trained surveillance specialists who know how to blend in and gather crucial evidence.",
        "Advanced technology for accurate and discreet monitoring.",
        "Confidentiality and privacy protection during all stages of surveillance.",
        "Real-time updates and post-investigation reports that provide clear evidence."
      ]
    },
    {
      "title": "Pre-Marital Investigation Services",
      "serviceOverview": "Oriental Detective offers discreet, professional Pre-Marital Investigation Services for individuals and families looking to ensure transparency and trust before making the commitment to marriage...",
      "whatWeDo": [
        "Criminal Background Check",
        "Financial Stability Assessment",
        "Family Background & Social Reputation",
        "Social Media & Digital Footprint",
        "Personal References Verification"
      ],
      "whenToContactUs": [
        "When considering marriage and want to ensure your partner’s background is transparent.",
        "If you have concerns about your partner’s past or their financial stability.",
        "If you want to verify that your partner does not have a criminal background.",
        "When entering into an arranged marriage and seeking clarity and peace of mind."
      ],
      "whyChooseUs": [
        "Comprehensive, multi-layered investigation that covers all aspects of your partner's life.",
        "Highly sensitive and confidential services that ensure privacy and respect.",
        "Experienced investigators with expertise in handling delicate, personal matters.",
        "Clear, detailed reports that provide peace of mind and clarity about your partner's past."
      ]
    }
  ]
}
